2.为什么?如果将一个类声明成public,则也要将文件名称取成和这个类一样的名称.
	将一个类声明为public,也就是这个文件的一个入口
3.\f			换页	
  \b			倒退一格
  \r			归位	
在编码过程中的实际意义.
5.操作数和被操作数的定义.赋值表达式的定义.
6.什么是成员覆写.
7.	非静态内部类不能定义静态属性,静态方法和静态内部类
8.在类外部引用内部类理解不透彻.
	内部类也可以通过创建对象从外部类之外被调用,只要将内部类声明为public即可.
9.在方法中定义的内部类只能访问方法中的final类型的局部变量,因为用final定义的局部变量相当于一个常量,它的生命周期超出方法运行的生命周期,
10.main方法的数组为String[] args,而普通方法为test(string arr[]);
11.CurrentTimeMillis()为什么是1970年.
12.为什么不重写hashCode就会返回null(13.7).
13.javacomplete2自动编译.奇怪.
14.集合框架的结构.
15.散列表是什么?(就是有链表的数组).
16.了解下枚举类型.
17.19.6.线程间通信不是很懂.
18.查看randomAccessFile的API,查看各方法的不同.
19.为什么非静态内部类不能定义静态属性/静态方法/和静态内部类.
20.用static声明的内部类变成了外部类,但是用static声明的内部类不能访问非static得外部类属性.
21.HashSet是否有序.
22.什么是Set
23.InputStreamReader用于将一个字节流中的字节解码成字符,outputStreamWriter用于将写入的字符编码车成字节后写入一个字节流.
24.什么时候该捕获异常,什么时候该抛异常.
